<?php

$default = [
    'new' => [
        'canceled' => 1
    ]
];

return [

    /*
    |--------------------------------------------------------------------------
    | Правила переходов статусов заявок на лабораторные исследования
    |--------------------------------------------------------------------------
    |
    | ...
    |
    |
    | Вид:
    | - Тип пользователя
    | - - Текущий статус
    | - - - Возможный статус
    |
    */

    'laboratory' => [
        'new' => [
            'in-work' => 1
        ],
        'in-work' => [
            'new' => 1,
            'done' => 1
        ],
    ],

    'store' => $default,
    'supplier' => $default,
    'delivery-service' => $default,
    'distribution-center' => $default,
];
