<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Интеграция с кассами
    |--------------------------------------------------------------------------
    |
    | Например: поиск карт лояльности.
    |
    */

    'cash-registers' => [

        'token' => env('INTEGRATIONS_CASH_REGISTERS_TOKEN', ''),

    ],

    /*
    |--------------------------------------------------------------------------
    | Интеграция с frontol кассами
    |--------------------------------------------------------------------------
    |
    |
    */

    'frontol' => [
        'token' => env('INTEGRATIONS_FRONTOL_TOKEN', ''),
        'useCode'   =>  env('USE_LOYALTY_CODE', false)
    ],
];
